### <font color="brown">Relational Databases - Continued</font>

---

#### <font color="brown">Example 2: Nobel Prize Winners Database - Version 2</font>

#### Minimizing Redundancy of Data Storage

---

#### <font color="brown">Inserting Individual Rows in Tables</font>

##### 1. Insert into **yearcat**

<pre>
mysql> insert into yearcat (year, category) values (2021, 'Chemistry');
mysql> select * from yearcat;
+----+------+-----------+
| id | year | category  |
+----+------+-----------+
|  1 | 2021 | Chemistry |
+----+------+-----------+
</pre>
https://dev.mysql.com/doc/refman/8.0/en/insert.html

- Note that we did not supply the value for <tt>id</tt> since it is defined to be auto incremented. Since this is the first insert, its value has been automatically set to 1.

- This value will increment to 2 when you add another row:

<pre>
mysql> insert into yearcat (year, category) values (2021, 'Economics');
mysql> select * from yearcat;
+----+------+-----------+
| id | year | category  |
+----+------+-----------+
|  1 | 2021 | Chemistry |
|  2 | 2021 | Economics |
+----+------+-----------+
</pre>

- You can explicitly set the <tt>id</tt> value if you want:

<pre>
mysql> insert into yearcat (id, year, category) values (3, 2021, 'Literature');
mysql> insert into yearcat (id, year, category) values (5, 2021, 'Peace');
mysql> select * from yearcat;
+----+------+------------+
| id | year | category   |
+----+------+------------+
|  1 | 2021 | Chemistry  |
|  2 | 2021 | Economics  |
|  3 | 2021 | Literature |
|  5 | 2021 | Peace      |
+----+------+------------+
</pre>

- However, if you attempt to use an existing id, you will get an error:

<pre>
mysql> insert into yearcat (id, year, category) values (3, 2021, 'Physics');
ERROR 1062 (23000): Duplicate entry '3' for key 'PRIMARY'
</pre>

- But this will work:

<pre>
mysql> insert into yearcat (id, year, category) values (4, 2021, 'Physics');
mysql> select * from yearcat;
+----+------+------------+
| id | year | category   |
+----+------+------------+
|  1 | 2021 | Chemistry  |
|  2 | 2021 | Economics  |
|  3 | 2021 | Literature |
|  4 | 2021 | Physics    |
|  5 | 2021 | Peace      |
+----+------+------------+
</pre>

- If you are inserting values for all the columns, you can skip the columns list and just list the values *in the order of columns in the create table definition*, e.g.

<pre>
mysql> insert into yearcat values (6, 2021, 'Medicine');
mysql> select * from yearcat;
+----+------+------------+
| id | year | category   |
+----+------+------------+
|  1 | 2021 | Chemistry  |
|  2 | 2021 | Economics  |
|  3 | 2021 | Literature |
|  4 | 2021 | Physics    |
|  5 | 2021 | Peace      |
|  6 | 2021 | Medicine   |
+----+------+------------+
</pre>

##### 2. Insert into **contribution**

<pre>
mysql> insert into contribution (motivation) 
          values ('for the development of asymmetric organocatalysis');
mysql> insert into contribution (motivation) 
          values ('for his empirical contributions to labour economics');
mysql> insert into contribution (motivation) 
          values ('for their methodological contributions to the analysis  of causal relationships');
mysql> select * from contribution;
+----+---------------------------------------------------------------------------------+
| id | motivation                                                                      |
+----+---------------------------------------------------------------------------------+
|  1 | for the development of asymmetric organocatalysis                               |
|  2 | for his empirical contributions to labour economics                            |
|  3 | for their methodological contributions to the analysis  of causal relationships |
+----+---------------------------------------------------------------------------------+
</pre>

##### 3. Insert into **laureate**

<pre>
mysql> insert into laureate values ('Benjamin','List',2,1,1);

mysql> insert into laureate values ('David','MacMillan',2,1,1);

mysql> select * from laureate;
+----------+-----------+-------+-------------+----------+
| fname    | lname     | share | year_cat_id | motiv_id |
+----------+-----------+-------+-------------+----------+
| Benjamin | List      |     2 |           1 |        1 |
| David    | MacMillan |     2 |           1 |        1 |
+----------+-----------+-------+-------------+----------+
</pre>
- Note that the <tt>year_cat_id</tt> value of 1 is the primary key (id) value 1 in the <tt>yearcat</tt> table, and the <tt>motiv_id</tt> value of 1 is the primary key (id) value 1 in the <tt>contribution</tt> table.

---

### <font color="brown">Database Access via Python</font>

---

#### <font color="brown">Install the Python driver for MySQL</font>
##### conda install -c anaconda mysql-connector-python

---

**<font color="brown">Before you get started with the following, make sure you quit the mysql session in Terminal. Otherwise, there will be a conflict when you set up another session via Python, and you will get indeterminate results.</font>**

In [1]:
# import connector module
import mysql.connector

In [22]:
# connect to nobels database
mydb = mysql.connector.connect(
  host="localhost",
  user="sesh",    # replace with your non-root username
  passwd="sesh",  # replace with your password
  database="nobels"
)

In [23]:
# set up for access
cursor = mydb.cursor()

In [4]:
# show table in the database
query = 'show tables'
cursor.execute(query)
res = cursor.fetchall()
for row in res:
    print(row)

('contribution',)
('laureate',)
('winners',)
('yearcat',)

---

##### MySQL Connector/Python Developer Guide: https://dev.mysql.com/doc/connector-python/en/

##### Cursor Methods: https://dev.mysql.com/doc/connector-python/en/connector-python-api-mysqlcursor.html

---

**Get number of rows in winners table**

In [5]:
query = 'select count(*) from winners' 
cursor.execute(query)
res = cursor.fetchall()
for row in res:
    print(row)
    print(row[0])

(975,)
975

**Get all data for the first 5 rows of winners table**

In [8]:
query = 'select * from winners limit 5' 
cursor.execute(query)
res = cursor.fetchall()
for row in res:
    print(row)

(2021, 'Chemistry', 'Benjamin', 'List', 'for the development of asymmetric organocatalysis', 2)
(2021, 'Chemistry', 'David', 'MacMillan', 'for the development of asymmetric organocatalysis', 2)
(2021, 'Economics', 'David', 'Card', 'for his empirical contributions  to labour economics', 2)
(2021, 'Economics', 'Joshua', 'Angrist', 'for their methodological contributions to the analysis  of causal relationships', 4)
(2021, 'Economics', 'Guido', 'Imbens', 'for their methodological contributions to the analysis  of causal relationships', 4)

**List contents of yearcat table**

In [17]:
query = 'select * from yearcat' 
cursor.execute(query)
res = cursor.fetchall()
for row in res:
    print(row)

(1, 2021, 'Chemistry')
(2, 2021, 'Economics')
(3, 2021, 'Literature')
(4, 2021, 'Physics')
(5, 2021, 'Peace')
(6, 2021, 'Medicine')

**List contents of contribution table**

In [24]:
query = 'select * from contribution' 
cursor.execute(query)
res = cursor.fetchall()
for row in res:
    print(row)

(1, 'for the development of asymmetric organocatalysis')
(2, 'for his empirical contributions to labour economics')
(3, 'for their methodological contributions to the analysis  of causal relationships')

**List contents of laureate table**

In [59]:
query = 'select * from laureate' 
cursor.execute(query)
res = cursor.fetchall()
for row in res:
    print(row)

('Benjamin', 'List', 2, 1, 1)
('David', 'MacMillan', 2, 1, 1)

**Insert a row in laureate table**

In [60]:
# set up sql template to add laureate
add_laureate = "insert into laureate values (%s, %s, %s, %s, %s)"

In [61]:
# add David Card to 2021 Economics
laureate = ('David','Card',2,2,2)  # share=2, year_cat_id=2, motiv_id=2
cursor.execute(add_laureate, laureate) # first arg is sql template, second is values tuple
print(cursor.rowcount,'record(s) inserted')
mydb.commit()  # update the database

1 record(s) inserted

**<font color="red">Note: You MUST do a commit after every database update.</font>**

In [62]:
# check the laureate table
query = 'select * from laureate' 
cursor.execute(query)
res = cursor.fetchall()
for row in res:
    print(row)

('Benjamin', 'List', 2, 1, 1)
('David', 'MacMillan', 2, 1, 1)
('David', 'Card', 2, 2, 2)

**Delete a row from laureate table**

In [63]:
# set up sql template to delete laureate
delete_laureate = "delete from laureate where fname=%s and lname=%s"
cursor.execute(delete_laureate, ('David','Card'))
mydb.commit()

In [64]:
# check the laureate table
query = 'select * from laureate' 
cursor.execute(query)
res = cursor.fetchall()
for row in res:
    print(row)

('Benjamin', 'List', 2, 1, 1)
('David', 'MacMillan', 2, 1, 1)

**Insert multiple rows in laureate table**

In [65]:
# let's add all 2021 Economics laureates in one shot
# year_cat_id=2 is same for all of them, but share and motiv_id vary
laureates = [('David','Card',2,2,2), ('Joshua','Angrist',4,2,3), ('Guido','Imbens',4,2,3)]
cursor.executemany(add_laureate, laureates)
print(cursor.rowcount,'record(s) inserted')
mydb.commit()  # update the database

3 record(s) inserted

In [66]:
# check the laureate table
query = 'select * from laureate' 
cursor.execute(query)
res = cursor.fetchall()
for row in res:
    print(row)

('Benjamin', 'List', 2, 1, 1)
('David', 'MacMillan', 2, 1, 1)
('David', 'Card', 2, 2, 2)
('Joshua', 'Angrist', 4, 2, 3)
('Guido', 'Imbens', 4, 2, 3)

---

##### <font color="brown">We're going to switch over to terminal to add a row to contribution, for literature in 2021. We're also going to delete the Physics, Peace, and Medicine entries for 2021, from yearcat </font>
##### <font color="brown"> Before we do that, we should close the cursor and the connection.</font>

In [81]:
cursor.close()

True

In [82]:
mydb.close()

<b>In Terminal:
<pre>
sesh> mysql -u sesh -p nobels
Enter password:

mysql> insert into contribution (motivation) values ('for his uncompromising and compassionate penetration of the effects of colonialism and the fate of the refugee in the gulf between cultures and continents');

mysql> select * from contribution;
+----+------------------------------------------------------------------------------------------------------------------------------------------------------------+
| id | motivation                                                                                                                                                 |
+----+------------------------------------------------------------------------------------------------------------------------------------------------------------+
|  1 | for the development of asymmetric organocatalysis                                                                                                          |
|  2 | for his empirical contributions to labour economics                                                                                                        |
|  3 | for their methodological contributions to the analysis  of causal relationships                                                                            |
|  4 | for his uncompromising and compassionate penetration of the effects of colonialism and the fate of the refugee in the gulf between cultures and continents |
+----+------------------------------------------------------------------------------------------------------------------------------------------------------------+

mysql> select * from yearcat;
+----+------+------------+
| id | year | category   |
+----+------+------------+
|  1 | 2021 | Chemistry  |
|  2 | 2021 | Economics  |
|  3 | 2021 | Literature |
|  4 | 2021 | Physics    |
|  5 | 2021 | Peace      |
|  6 | 2021 | Medicine   |
+----+------+------------+
6 rows in set (0.00 sec)

mysql> delete from yearcat where id > 3;
Query OK, 3 rows affected (0.00 sec)

mysql> select * from yearcat;
+----+------+------------+
| id | year | category   |
+----+------+------------+
|  1 | 2021 | Chemistry  |
|  2 | 2021 | Economics  |
|  3 | 2021 | Literature |
+----+------+------------+
3 rows in set (0.00 sec)

mysql> select * from winners where year=2021 and category='Physics';
+------+----------+---------+------------+---------------------------------------------------------------------------------------------------------------------+-------+
| year | category | fname   | lname      | motivation                                                                                                          | share |
+------+----------+---------+------------+---------------------------------------------------------------------------------------------------------------------+-------+
| 2021 | Physics  | Syukuro | Manabe     | for the physical modelling of Earth’s climate, quantifying variability and reliably predicting global warming       |     4 |
| 2021 | Physics  | Klaus   | Hasselmann | for the physical modelling of Earth’s climate, quantifying variability and reliably predicting global warming       |     4 |
| 2021 | Physics  | Giorgio | Parisi     | for the discovery of the interplay of disorder and fluctuations in physical systems from atomic to planetary scales |     2 |
+------+----------+---------+------------+---------------------------------------------------------------------------------------------------------------------+-------+

mysql> exit
Bye
</pre>

---

*Back to Python programming*

##### <font color="brown">Make sure to redo the mydb connection and set up cursor, like we did initially. Just jump to and re-execute those cells, then jump back here.</font>

---

**Insert a row in laureate table, for literature prize in 2021**

In [71]:
# add Abdulrazak Gurnah to 2021 Literature
laureate = ('Abdulrazak','Gurnah',1,3,4)  # share=1, year_cat_id=3, motiv_id=4
cursor.execute(add_laureate, laureate) 
print(cursor.rowcount,'record(s) inserted')
mydb.commit()  # update the database

1 record(s) inserted

In [72]:
# check the laureate table
query = 'select * from laureate' 
cursor.execute(query)
res = cursor.fetchall()
for row in res:
    print(row)

('Benjamin', 'List', 2, 1, 1)
('David', 'MacMillan', 2, 1, 1)
('David', 'Card', 2, 2, 2)
('Joshua', 'Angrist', 4, 2, 3)
('Guido', 'Imbens', 4, 2, 3)
('Abdulrazak', 'Gurnah', 1, 3, 4)

---

#### <font color="brown">Adding to all three tables (yearcat, contribution, and laureate), retaining id from yearcat and contribution for add to laureate</font>

##### <font color="brown">Add Physics laureates for 2021</font>

**Set up sql templates and values**

In [76]:
# set up sql template and values for yearcat table
add_yearcat = "insert into yearcat (year,category) values (%s,%s)"
yc_val =  (2021,'Physics')

# set up sql template and values for contribution table
add_contribution = "insert into contribution (motivation) values (%s)"

str1 = 'for the physical modelling of Earth’s climate, ' 
str2 = 'quantifying variability and reliably predicting global warming'
share4_contrib = str1 + str2        

str1 = 'for the discovery of the interplay of disorder and fluctuations '
str2 = 'in physical systems from atomic to planetary scales'
share2_contrib = str1 + str2

##### **Add to yearcat and get last added id using cursor.lastrowid. Similarly for contribution. Then add laureates.**
https://dev.mysql.com/doc/connector-python/en/connector-python-api-mysqlcursor-lastrowid.html

In [79]:
# add yearcat, and get last added id
cursor.execute(add_yearcat, yc_val)
mydb.commit()  # update the database
yc_id = cursor.lastrowid
print(yc_id)

7

**The id is 7 because the max id that had been added was 6 (Medicine). Subsequently, we deleted the ids 4,5,6 but that does not change the fact that max id ever added was 6. So a new add gets id=6+1=7.**

In [80]:
# add share4 contributon and get last added id
cursor.execute(add_contribution, (share4_contrib,))  # Note the tuple syntax!! Only one value to be added
mydb.commit()  # update the database
contrib_id = cursor.lastrowid
print(contrib_id)

5

In [30]:
# now add the two laureates at a share of 4 apiece
laureates = [('Syukuro','Manabe',4,yc_id,contrib_id), ('Klaus','Hasselmann',4,yc_id,contrib_id)]
cursor.executemany(add_laureate,laureates)
mydb.commit()

2 record(s) inserted

In [ ]:
# add share2 contributon and get last added id
cursor.execute(add_contribution, (share2_contrib,))  
mydb.commit()  # update the database
contrib_id = cursor.lastrowid

In [28]:
# add the third laureate, with a share of 2
cursor.execute(add_laureate,('Giorgio','Parisi',2,yc_id,contrib_id))
print(cursor.rowcount,'record(s) inserted')
mydb.commit()

1 record(s) inserted

In [85]:
# get contents of laureate table
query = 'select * from laureate'
cursor.execute(query)
res = cursor.fetchall()
for row in res:
    print(row)

('Benjamin', 'List', 2, 1, 1)
('David', 'MacMillan', 2, 1, 1)
('David', 'Card', 2, 2, 2)
('Joshua', 'Angrist', 4, 2, 3)
('Guido', 'Imbens', 4, 2, 3)
('Abdulrazak', 'Gurnah', 1, 3, 4)
('Syukuro', 'Manabe', 4, 7, 5)
('Klaus', 'Hasselmann', 4, 7, 5)
('Giorgio', 'Parisi', 2, 7, 6)

In [25]:
cursor.close()

True

In [26]:
mydb.close()